2022_2/Program_Web/Aula17.AS/www/codeigniter4/app/Models/UserModel.php

    public function getUser($userName){
        return $this -> where('user', $userName)->first();
---
SELECT *
FROM `users`
WHERE `user` IS NULL
 LIMIT 1